In [1]:
%load_ext sql
import pandas as pd

In [2]:
%sql postgresql://postgres:@127.0.0.1/

In [3]:
result = %sql SELECT * FROM songplay_table;
df = pd.DataFrame(result)
df

 * postgresql://postgres:***@127.0.0.1/sparkifydb
6820 rows affected.

,0,1,2,3,4,5,6,7,8
0,1,2018-11-01 09:01:46,8,free,None,None,139,"Phoenix-Mesa-Scottsdale, AZ","""Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebK..."
1,2,2018-11-01 09:05:52,8,free,None,None,139,"Phoenix-Mesa-Scottsdale, AZ","""Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebK..."
2,3,2018-11-01 09:08:16,8,free,None,None,139,"Phoenix-Mesa-Scottsdale, AZ","""Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebK..."
3,4,2018-11-01 09:11:13,8,free,None,None,139,"Phoenix-Mesa-Scottsdale, AZ","""Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebK..."
4,5,2018-11-01 09:17:33,8,free,None,None,139,"Phoenix-Mesa-Scottsdale, AZ","""Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebK..."
...,...,...,...,...,...,...,...,...,...
6815,6816,2018-11-30 06:40:05,16,paid,None,None,1076,"Birmingham-Hoover, AL","""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4..."
6816,6817,2018-11-30 06:44:36,16,paid,None,None,1076,"Birmingham-Hoover, AL","""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4..."
6817,6818,2018-11-30 06:47:58,16,paid,None,None,1076,"Birmingham-Hoover, AL","""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4..."
6818,6819,2018-11-30 06:51:24,16,paid,None,None,1076,"Birmingham-Hoover, AL","""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4..."
6819,6820,2018-11-30 07:54:24,5,free,None,None,985,"Detroit-Warren-Dearborn, MI","""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4..."

In [15]:
result = %sql SELECT * FROM users_table;
df = pd.DataFrame(result)
df.info()

 * postgresql://postgres:***@127.0.0.1/sparkifydb
97 rows affected.
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 97 entries, 0 to 96
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       97 non-null     int64
 1   1       97 non-null     object
 2   2       97 non-null     object
 3   3       97 non-null     object
 4   4       97 non-null     object
dtypes: int64(1), object(4)
memory usage: 3.9+ KB

In [9]:
result = %sql SELECT * FROM song_table;
df = pd.DataFrame(result)
df

 * postgresql://postgres:***@127.0.0.1/sparkifydb
71 rows affected.

                     0                 1                   2     3          4
0   SOMZWCG12A8C13C480  I Didn't Mean To  ARD7TVE1187B99BFB1     0  218.93179
1   SOCIWDW12A8C13D406         Soul Deep  ARMJAGH1187FB546F3  1969  148.03546
2   SOXVLOJ12AB0189215   Amor De Cabaret  ARKRRTF1187B9984DA     0  177.47546
3   SONHOTT12A8C13493C   Something Girls  AR7G5I41187FB4CE6C  1982  233.40363
4   SOFSOCN12A8C143F5D    Face the Ashes  ARXR32B1187FB57099  2007  209.60608
..                 ...               ...                 ...   ...        ...
66  SOINLJW12A8C13314C     City Slickers  AR8IEZO1187B99055E  2008  149.86404
67  SOGDBUF12A8C140FAA             Intro  AR558FS1187FB45658  2003   75.67628
68  SORRZGD12A6310DBC3    Harajuku Girls  ARVBRGZ1187FB4675A  2004  290.55955
69  SODAUVL12A8C13D184         Prognosis  ARWB3G61187FB49404  2000  363.85914
70  SOFCHDR12AB01866EF       Living Hell  AREVWGE1187B9B890A     0  282.43546

[71 rows x 5 columns]

In [14]:
result = %sql SELECT * FROM artists_table;
df = pd.DataFrame(result)
df.info()

 * postgresql://postgres:***@127.0.0.1/sparkifydb
69 rows affected.
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 69 entries, 0 to 68
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       69 non-null     object
 1   1       69 non-null     object
 2   2       69 non-null     object
 3   3       69 non-null     object
 4   4       69 non-null     object
dtypes: object(5)
memory usage: 2.8+ KB

In [16]:
result = %sql SELECT * FROM time_table;
df = pd.DataFrame(result)
df.info()

 * postgresql://postgres:***@127.0.0.1/sparkifydb
6803 rows affected.
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6803 entries, 0 to 6802
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       6803 non-null   datetime64[ns]
 1   1       6803 non-null   int64
 2   2       6803 non-null   int64
 3   3       6803 non-null   int64
 4   4       6803 non-null   int64
 5   5       6803 non-null   int64
 6   6       6803 non-null   int64
dtypes: datetime64[ns](1), int64(6)
memory usage: 372.2 KB

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).